app/controllers/api/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)
    @subject.author_id = current_user.id
    # tommy's line below: isn't working.
    # @subject = current_user.subjects.new(subject_params)
    if @subject.save
---
INSERT INTO "subjects" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "English"], ["author_id", 1], ["created_at", "2016-01-28 21:12:54.910820"], ["updated_at", "2016-01-28 21:12:54.910820"]]

  def index
    # @subjects = Subject
    # @subjects = current_user.subjects.includes(decks: [:cards])
    @subjects = current_user.subjects.includes(:decks)
---
SELECT "subjects".* FROM "subjects"