app/views/users/show.html.erb

<ul>
  <% current_user.subjects.each do |subject| %>
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."user_id" = ?  [[nil, 3]]