app/views/subjects/show.html.erb

SELECT "decks".* FROM "decks" WHERE "decks"."subject_id" = ?  [["subject_id", 2]]
---
<ul>
  <% @subject.decks.each do |deck| %>