app/controllers/decks_controller.rb

  def create
    @deck = Deck.new(deck_params)
    @deck.author_id = current_user.id
    if @deck.save
---
INSERT INTO "decks" ("name", "subject_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fifthdeck"], ["subject_id", 2], ["author_id", 3], ["created_at", "2016-01-26 20:18:11.565728"], ["updated_at", "2016-01-26 20:18:11.565728"]]

  def destroy
    deck = Deck.find(params[:id])
    deck.destroy
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 6]]