app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)
    @subject.author_id = current_user.id
    if @subject.save
---
INSERT INTO "subjects" ("title", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My First Subject"], ["author_id", 3], ["created_at", "2016-01-26 19:49:15.584088"], ["updated_at", "2016-01-26 19:49:15.584088"]]

  def show
    @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]